gdamore/illumos-core/usr/src/man/man1m/link.1m
.\" Copyright 2014 Garrett D'Amore <garrett@damore.org>
.\" Copyright 1989 AT&T
.\" Copyright (c) 2002Sun Microsystems, Inc.  All Rights Reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.Dd Sep 6, 2014
.Dt LINK 1M
.Os
.Sh NAME
.Nm link ,
.Nm unlink
.Nd link and unlink files and directories
.
.Sh SYNOPSIS
.
.Nm link
.Ar existing-file
.Ar new-file
.
.Nm unlink
.Ar file
.
.Sh DESCRIPTION
The
.Nm link
and
.Nm unlink
commands link and unlink files and directories.
Only super-users can use these commands on directories.
.Lp
Use
.Nm link
to create a new file that points to an existing file. The
.Ar existing-file
and
.Ar new-file
operands specify the existing file and
newly-created files. See
.Sx OPERANDS .
.Lp
.Nm link
and
.Nm unlink
directly invoke the
.Xr link 2
and
.Xr unlink 2
system calls, performing exactly what they are told to do and
abandoning all error checking. This differs from the
.Xr ln 1
command.
.Lp
While linked files and directories can be removed using
.Nm unlink ,
it is safer to use
.Xr rm 1
and
.Xr rmdir 1
instead.
.Lp
If the existing file being hard linked is itself a symbolic link, then the
newly created file
.Pq Ar new-file
will be a hard link to the file referenced
by the symbolic link, not to the symbolic link object itself
.Pq Ar existing-file .
.
.Sh OPERANDS
.
The following operands are supported:
.Bl -tag -width indent
.
.It Ar existing-file
Specifies the name of the existing file to be linked.
.
.It Ar file
Specifies the name of the file to be unlinked.
.
.It Ar new-file
Specifies the name of newly created (linked) file.
.El
.
.Sh ENVIRONMENT VARIABLES
.
See
.Xr environ 5
for descriptions of the following environment variables
that affect the execution of
.Nm link :
.Ev  LANG , LC_ALL , LC_CTYPE , LC_MESSAGES No and Ev NLSPATH .
.
.Sh EXIT STATUS
.Ex -std link unlink
.
.Sh INTERFACE STABILITY
.
.Sy Standard .
.
.Sh SEE ALSO
.
.Xr ln 1 ,
.Xr rm 1 ,
.Xr link 2 ,
.Xr unlink 2 ,
.Xr environ 5 ,
.Xr standards 5
