gdamore/illumos-core/usr/src/man/man7d/sfxge.7d
.\"
.\" This file and its contents are supplied under the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.illumos.org/license/CDDL.
.\"
.\"
.\" Copyright 2016 Garrett D'Amore <garrett@damore.org>
.\"
.Dd Mar 10, 2016
.Dt SFXGE 7D
.Os
.Sh NAME
.Nm sfxge
.Nd SolarFlare Ethernet device driver
.Sh SYNOPSIS
.Pa /dev/sfxge
.Sh DESCRIPTION
The
.Nm
driver provides support for SolarFlare family of 1, 10, and 40 Gbps
Ethernet PCI controllers from the SFC 9000 family.
.Lp
These devices generally support the standard Ethernet features, including
autonegotiation, etc.  They also support full size MTUs (1500 bytes),
even when used with VLANs, and hardware based flow control.
.Lp
The device driver supports the
.Xr ieee802.3 5
properties, which can be configured with
.Xr dladm 1M .
.Sh FILES
.Bl -tag -width /dev/sfxge
.It Pa /dev/sfxge
Special character device.
.El
.
.Sh SEE ALSO
.Xr dladm 1M ,
.Xr ifconfig 1M ,
.Xr pci 4 ,
.Xr ieee802.3 5 ,
.Xr dlpi 7P
.Rs
.%T IEEE 802.3: Ethernet
.%Q IEEE Standards Association
.Re
.Sh BUGS
The hardware has support for multiple hardware rings, providing for
receive side scaling (RSS) and improved virtualization.
This driver currently lacks support for exposing this functionality
to the operating system.
